{"schema":5,"addons":[{"id":"{77d2ed30-4cd2-11e0-b8af-0800200c9a66}","icons":{"32":"https://addons.cdn.mozilla.net/user-media/addon_icons/295/295337-32.png?modified=d71eeb92","64":"https://addons.cdn.mozilla.net/user-media/addon_icons/295/295337-64.png?modified=d71eeb92"},"name":"FT DeepDark","type":"theme","version":"14.4.7","repositoryStatus":4,"creator":{"name":"steva","url":"https://addons.mozilla.org/en-US/firefox/user/steva/?src=api"},"description":"Simple and smooth dark complete theme for Firefox.","fullDescription":">>>>>>>>>>>>>>>>>>>>>>>>>>>>>> IMPORTANT <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<\n\nCOMPATIBILITY WITH FIREFOX 57+\nSince, for the moment, the Firefox theming API is still a work in progress and doesn't allow to create real \"complete\" themes packages for Firefox Quantum (57+) I can't do nothing so FT DeepDark could be installed/updated AS AN ADDON.\nWhen there will be news about the future of my theme, I will notify it on my Twitter account.\n\nPlease do not use the review section to comment anything related with compatibility, the review section is not there for that. Thank you for your understanding.\n\n\n>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<\n\n\n\"FT DeepDark\" is a theme which has been created to transform the look of Firefox for Windows users. It has been specially designed for Windows 7 (with Aero Style enabled), but it can also be installed on other Windows versions and Linux (just be aware that some things may look different due to differences between platforms). It does NOT officially support Aurora/Firefox Developer Edition, Nightly and any Firefox forked versions (such as Palemoon, Cyberfox, Waterfox, etc.).\n\nIt contains no added functionalities, it's simply a full Firefox's GUI aesthetic customization.\n\n__\n\n\nBefore posting a review, please take the time to read first the review guidelines described here: https://addons.mozilla.org/en-US/review_guide. Thank you.\n\n__\n\n\nWHAT TO DO WHEN FACING AN ISSUE WITH FT DEEPDARK?\n\n1) before reporting it, first try to see if the issue is due to the theme itself. How ? Enable the default theme and check if the issue is still there. If not, enable again the FT theme, but disable all other installed addons to check if the issue can be due to a conflict between addons.\n\n\n2) If the issue is still there after disabling all other addons and if the default theme doesn t have that issue, try to download and install again the theme (check also if you have the latest version installed, maybe the bug you want to report has already been solved with the latest updates).\n\n\n3) if after trying what mentioned above the problem is linked with the use of the FT theme, please, send me an e-mail (there is a link on the add-ons page to contact me) instead of reporting the bug in the add-on's review section. When sending an e-mail to report a bug, do not forget to tell me which operating system (Windows XP, 7, Vista, Linux, etc.) you are running on your computer, which version of Firefox and FT theme you are using and if you have any operating system custom theme (it can also be a cause of the issue). Then, describe the most precisely you can the issue you are facing and, if possible, please, join a screenshot and/or a short video so I could see exactly how it looks (English is not my mother tongue, so a picture can avoid the language problems). All that will help me to understand better what is the problem and to solve it quicker if possible.\nI can t promise you that I ll manage to fix every problems and also in short time, but I ll do my best for it. I m working on my themes during my free time so it can take a bit time before fixing the issues (you need also to be conscious that any updates need to be checked by Mozilla first, but if you want to have the updates a bit quicker you can follow me on Twitter and know immediately when a new version is available for download).","isPlatformCompatible":true,"eula":"Free for non-commercial personal use. Copyright of all graphics elemets designed for this theme belongs to the AUTHOR. Before any modifications and/or distribution of this work, please contact me (you can use FT DeepDark's support link for that purpose) and read the license file included inside the theme package.","screenshots":[{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/208/208409.png?src=api&modified=1537447504","width":"800","height":"600","thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/208/208409.png?src=api&modified=1537447504","thumbnailWidth":"267","thumbnailHeight":"200","caption":"FT Deepdark"}],"averageRating":5,"learnmoreURL":"https://addons.mozilla.org/en-US/firefox/addon/ft-deepdark/?src=api","homepageURL":"https://addons.mozilla.org/en-US/firefox/addon/ft-deepdark/?src=api","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/744033/ft_deepdark-14.4.7-fx-windows.xpi?src=api","size":2255121,"contributionURL":"https://www.paypal.me/stefrosselli","contributionAmount":null,"developerComments":"Special thanks to :\n\nAxel G., Ken S., Ken B. and Ivana R.","reviewURL":"https://addons.mozilla.org/en-US/firefox/addon/ft-deepdark/reviews/?src=api","reviewCount":914,"totalDownloads":6940221,"weeklyDownloads":212,"dailyUsers":4856,"updateDate":1507962556000,"supportURL":null},{"id":"{81BF1D23-5F17-408D-AC6B-BD6DF7CAF670}","icons":{"32":"https://addons.cdn.mozilla.net/user-media/addon_icons/3/3863-32.png?modified=d7d733b4","64":"https://addons.cdn.mozilla.net/user-media/addon_icons/3/3863-64.png?modified=d7d733b4"},"name":"iMacros for Firefox","type":"extension","version":"10.0.2.1450","repositoryStatus":4,"creator":{"name":"Ipswitch, Inc.","url":"https://addons.mozilla.org/en-US/firefox/user/IpswitchInc/?src=api"},"description":"Automate Firefox. Record and replay repetitive tasks. If you're tired of manually visiting the same sites, filling out forms, downloading files and extracting data, then iMacros is for you! Save time, effort and money with iMacros browser automation!","fullDescription":"iMacros is designed to automate the most repetitious tasks on the web. If there’s an activity you have to do repeatedly, just record it in iMacros. The next time you need to do it, the entire task will be completed at the click of a button! With iMacros, you can quickly and easily fill out web forms, download files, extract text and images, and more. The uses are limited only by your imagination!\n\nBoth personal and business users take advantage of iMacros to save tremendous amounts of time and money, whether they are auto-filling forms, downloading PDF reports or other types of files, taking web page screenshots, or routinely gathering data to stay ahead of the competition!\n\nWeb developers use iMacros for web regression testing, performance testing and web transaction monitoring. It can also be combined with Firebug and other web development and test tools. XPath support is included.\n\nMacros are text based - with support for password encryption - and can be stored as either bookmarks or external files. Macro files can be edited with any text editor, and macro bookmarks can be edited with the included editor.\n\nMacros can also be started via the command line e. g. via the Windows task scheduler, batch files, or a Linux cron job for unattended operation.\n\nMacros recorded with iMacros for Firefox can be replayed in iMacros for Chrome, iMacros for IE, and the iMacros browser without changes! All iMacros versions combined have millions of active users, making it the most popular web browser automation tool.\n\nSo what are you waiting for? Start eliminating hassle and stop wasting time by downloading and using iMacros today!\n\nWith the release of iMacros for Firefox 10.0, some features are only available with a Personal Edition (or higher) license. Purchase any iMacros license and download the File Access for iMacros Extensions module from your Ipswitch account. Customers with active service agreements for iMacros 12 already will be able to access this new module for upgrading to the full version of iMacros for Firefox 10. Download the installer from your Ipswitch Community account.\n\nFor more information please visit iMacros wiki and the active user forum","isPlatformCompatible":true,"eula":null,"screenshots":[{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/204/204906.png?src=api&modified=1530874183","width":"1257","height":"800","thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/204/204906.png?src=api&modified=1530874183","thumbnailWidth":"314","thumbnailHeight":"200","caption":"iMacros for Firefox"},{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/204/204907.png?src=api&modified=1530874183","width":"1060","height":"239","thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/204/204907.png?src=api&modified=1530874183","thumbnailWidth":"320","thumbnailHeight":"72","caption":"Play, stop and resume from Firefox toolbar."},{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/204/204908.png?src=api&modified=1530874183","width":"1067","height":"800","thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/204/204908.png?src=api&modified=1530874183","thumbnailWidth":"267","thumbnailHeight":"200","caption":"Use iMacros as super bookmarks, and automate not only the login but the complete task (login, saving reports, uploading files,...)."},{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/204/204909.png?src=api&modified=1530874183","width":"1067","height":"800","thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/204/204909.png?src=api&modified=1530874183","thumbnailWidth":"267","thumbnailHeight":"200","caption":"From the iMacros sidebar you can control the macro playback, record and edit macros."},{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/204/204910.png?src=api&modified=1530874183","width":"1280","height":"629","thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/204/204910.png?src=api&modified=1530874183","thumbnailWidth":"320","thumbnailHeight":"157","caption":"Modern, attractive UI. You can store your macros as bookmarks or files (Windows only)."},{"url":"https://addons.cdn.mozilla.net/user-media/previews/full/204/204912.png?src=api&modified=1530874190","width":"1100","height":"726","thumbnailURL":"https://addons.cdn.mozilla.net/user-media/previews/thumbs/204/204912.png?src=api&modified=1530874190","thumbnailWidth":"303","thumbnailHeight":"200","caption":"Macros are in plain text. Also if stored as bookmarks."}],"averageRating":4,"learnmoreURL":"https://addons.mozilla.org/en-US/firefox/addon/imacros-for-firefox/?src=api","homepageURL":"https://imacros.net","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/1010021/imacros_for_firefox-10.0.2.1450-an+fx-windows.xpi?src=api","size":556675,"developerComments":"FIND A BUG OR NEED HELP? Please post your feedback in the user forum so we can help you, rather than reporting it here.","reviewURL":"https://addons.mozilla.org/en-US/firefox/addon/imacros-for-firefox/reviews/?src=api","reviewCount":1296,"totalDownloads":19971112,"weeklyDownloads":22555,"dailyUsers":249663,"updateDate":1531149609000,"supportURL":"https://forum.imacros.net/viewforum.php?f=11"}]}